<template>
    <p class="text-3xl font-Cormorant uppercase tracking-widest font-semibold">История космонавтики</p>
    <div class="flex max-lg:flex-col gap-6 items-center">
        <div class="flex flex-col gap-4 w-full lg:w-1/2">
            <p class="font-Cormorant tracking-widest font-semibold text-2xl">Эра Начала (до 2020 года)</p>
            <p class="opacity-50 tracking-wider">В далёком прошлом, когда люди только начинали смотреть на звёзды с мечтами о полёте, Юрий Гагарин первым покорил космос, открыв двери во Вселенную. В 1961 году он облетел Землю на корабле "Восток-1", доказав, что человек может выжить в условиях невесомости. За ним последовали другие смельчаки, и вскоре космос стал ареной для соревнования сверхдержав.</p>
            <p class="opacity-50 tracking-wider">Затем, в 1969 году, мир наблюдал, как Нил Армстронг и Базз Олдрин ступили на Луну, произнеся знаменитые слова: "Это один маленький шаг для человека, но гигантский скачок для человечества." Миссии "Аполлон" показали, что полёты на другие планеты возможны, и вдохновили целые поколения учёных и инженеров.</p>
            <p class="opacity-50 tracking-wider">Следующим крупным этапом стало создание Международной космической станции (МКС), которая с 1998 года стала орбитальным домом для землян. МКС стала символом международного сотрудничества в космосе, объединяя усилия NASA, Роскосмоса, ESA, JAXA и других космических агентств.</p>
        </div>
        <img src="/images/history/1.jpg" alt="" class="rounded-xl w-full lg:w-1/2 border border-white/15 object-cover aspect-video lg:aspect-[7/10]">
    </div>
    <div class="flex max-lg:flex-col gap-6 items-center">
        <div class="flex flex-col gap-2 w-full lg:w-1/2">
            <p class="font-Cormorant tracking-widest font-semibold">Период Расцвета (2020-2025 годы)</p>
            <p class="opacity-50 tracking-wider">В 2020 году Илону Маску и его компании SpaceX удалось осуществить историческую миссию: первая коммерческая пилотируемая миссия на МКС. Астронавты Роберт Бенкен и Дуглас Хёрли стали первыми, кто отправился в космос на частном космическом корабле Crew Dragon. Это ознаменовало начало новой эры в космонавтике, когда частные компании стали играть ключевую роль в освоении космоса.</p>
            <p class="opacity-50 tracking-wider">К 2023 году китайское космическое агентство успешно завершило строительство своей орбитальной станции Тяньгун, а в 2024 году ESA и NASA начали активно разрабатывать совместные миссии к астероидам, чтобы защитить Землю от потенциальных угроз из космоса.</p>
            <p class="opacity-50 tracking-wider">Кульминацией этого периода стала миссия Artemis, инициированная NASA, в рамках которой в 2025 году на Луну снова ступила нога человека. Новые технологии позволили создать долговременные базы на поверхности спутника, обеспечивая постоянное присутствие людей на Луне.</p>
        </div>
        <img src="/images/history/2.jpg" alt="" class="rounded-xl w-full lg:w-1/2 border border-white/15 lg:order-first object-cover aspect-video lg:aspect-[7/10]">
    </div>
    <div class="flex max-lg:flex-col gap-6 items-center">
        <div class="flex flex-col gap-2 w-full lg:w-1/2">
            <p class="font-Cormorant tracking-widest font-semibold">Эпоха Колонизации (2025-2030 годы)</p>
            <p class="opacity-50 tracking-wider">2026 год стал переломным моментом: первая колония на Луне приняла своих первых жителей. Лунные города начали расти, как грибы после дождя. Куполообразные здания, защищенные от радиации и микрометеоритов, стали домом для ученых, инженеров и их семей. Создание систем жизнеобеспечения, использование ресурсов Луны для производства воды и кислорода сделали лунные поселения автономными.</p>
            <p class="opacity-50 tracking-wider">В 2027 году был открыт первый космический отель на орбите Земли, предлагающий туристам незабываемые виды на голубую планету. SpaceX и Blue Origin начали активно развивать рынок космического туризма, предлагая орбитальные круизы и экскурсии на Луну.</p>
            <p class="opacity-50 tracking-wider">В 2028 году международная миссия высадилась на Марсе, начав строительство первой марсианской базы. Астронавты из разных стран объединились, чтобы исследовать Красную планету и подготовить её к колонизации. Система подземных туннелей и куполов обеспечила защиту от радиации и экстремальных температур, а марсоходы и дроиды стали незаменимыми помощниками в освоении планеты.</p>
            <p class="opacity-50 tracking-wider">В 2029 году началась активная разработка астероидов. Космические компании начали устанавливать заводы на астероидах, чтобы использовать их богатые ресурсы для производства строительных материалов и топлива.</p>
        </div>
        <img src="/images/history/3.jpg" alt="" class="rounded-xl w-full lg:w-1/2 border border-white/15 object-cover aspect-video lg:aspect-[7/10]">
    </div>
    <div class="flex max-lg:flex-col gap-6 items-center">
        <div class="flex flex-col gap-2 w-full lg:w-1/2">
            <p class="font-Cormorant tracking-widest font-semibold">Век Галактического Расширения (2030-2035 годы)</p>
            <p class="opacity-50 tracking-wider">В 2030 году на орбиту Плутона была запущена миссия "Космическая Одиссея", которая доставила первые колонии научных станций для изучения дальних рубежей Солнечной системы. Научные данные, полученные с этих станций, открыли новые горизонты в понимании нашего космического соседства и его истории.</p>
            <p class="opacity-50 tracking-wider">В это же время компания Blue Origin объявила о планах по созданию космических заводов на астероидах, чтобы использовать их ресурсы для строительства мегаструктур. Эти заводы стали первыми шагами к созданию больших орбитальных городов и станций, которые могли бы служить перевалочными пунктами для дальних космических миссий.</p>
            <p class="opacity-50 tracking-wider">К 2032 году космический туризм стал доступен не только элите, но и среднему классу. Лунные курорты, марсианские сафари и орбитальные круизы стали популярными направлениями для отдыха. Люди могли насладиться прогулками по лунным долинам, полетать на параплане над марсианскими каньонами или просто провести выходные в невесомости, наблюдая за Землей.</p>
            <p class="opacity-50 tracking-wider">В 2035 году произошло знаменательное событие: запуск первого межзвёздного корабля "Вояджер II", нацеленного на исследование ближайшей звезды Проксима Центавра. Этот корабль, оснащённый новейшими технологиями, включая двигатели на антиматерии, открыл новую главу в истории человечества — главу межзвёздных путешествий. "Вояджер II" отправился в путь, несущий на борту послания и артефакты человеческой культуры, символизируя стремление человечества к исследованию и познанию.</p>
        </div>
        <img src="/images/history/4.jpg" alt="" class="rounded-xl w-full lg:w-1/2 border border-white/15 lg:order-first object-cover aspect-video lg:aspect-[7/10]">
    </div>
</template>

<script setup>

</script>